[
  {
    "url": "personal-information",
    "title": "Author’s Personal Information",
    "content": "Name: Hoang Minh Khoi\nEmail: hoangminhkhoi3108@gmail.com\nPhone: 0422296339\nLinkedIn: https://www.linkedin.com/in/tom-hoang-3a99ba319/\nShort Bio:\nThird-year Bachelor of AI, Deakin University. Passionate AI enthusiast with experience in machine learning, deep learning, and data analysis."
  },
  {
    "url": "https://programming-showcase-new.vercel.app/",
    "title": "Create Next App",
    "content": "Create Next App Home About Project Changelog Welcome to My Portfolio Explore my work and experience in AI 💬 Aspiring AI \"Consistence is key to success\" Hoang Minh Khoi Email: hoangminhkhoi3108@gmail.com Phone: 0422296339 LinkedIn: Tom Hoang Summary Passionate AI enthusiastic with experience in machine learning, deep learning, and data analysis. Experience FPT Software - Full Stack Developer & AI researcher (STU) Oct 2023 - Jan 2024 Built advanced regression, classification, and clustering models for research and product development Collaborated with senior DevOps, achieving a 15% boost in coding efficiency FPT Software - AI Prompt (EBS) Oct 2024 - Jan 2025 Created and optimized AI prompts for email automation, translation, and data analysis Implemented data pipelines for more efficient processing and analytics Twin - AI Prompt & Chatbot Oct 2024 - Jan 2025 Developed and integrated AI-driven chatbots using Google “Gemini” with vector DB and BigQuery Implement new conversation-based features that boosted overall efficiency by 20% Education Deakin University - Bachelor of Artificial Intelligence 2023 - Current Skills Machine Learning 85% Prompting 95% NLP 90% Deep Learning 85%"
  },
  {
    "url": "https://programming-showcase-new.vercel.app/about",
    "title": "Create Next App",
    "content": "Create Next App Home About Project Changelog Hello, I'm Tom Third Year Student At Deakin University Hello! I'm currently a third-year student at Deakin University, pursuing a Bachelor of Artificial Intelligence. My studies focus on developing innovative AI solutions and understanding the ethical implications of AI technologies. I'm passionate about leveraging AI to solve real-world problems and enhance everyday life. Recent Achievements Achievement 1 January 2024 Description of achievement 1 Achievement 2 March 2024 Description of achievement 2 Achievement 3 May 2024 Description of achievement 3 Hobbies & Interests Gym Gaming Music Photography Quote that will always live free in my head \"Precision is the difference between a butcher and a surgeon.\" - Camille"
  },
  {
    "url": "https://programming-showcase-new.vercel.app/project",
    "title": "Create Next App",
    "content": "Create Next App Home About Project Changelog Projects Lost In Space \"A 2-D space exploration\" Additional content Additional content Additional content Additional content View Project AI Chatbox \"Chatbox powered by Gemini \" Additional content Additional content Additional content Additional content View Project Statistics Description of the project Additional content Additional content Additional content Additional content View Project Statistics Description of the project Additional content Additional content Additional content Additional content View Project"
  },
  {
    "url": "https://programming-showcase-new.vercel.app/changelog",
    "title": "Create Next App",
    "content": "Create Next App Home About Project Changelog Development Timeline 2024-01-15 v 1.2.0 AI Projects Integration • Added Machine Learning showcase section • Integrated project timeline feature • Enhanced responsive design 2024-12-16 v 1.0.0 Animation Expansion • Added animations to improve user experience • Updated Project page with related projects • Replaced static content with dynamic data 2024-12-10 v 1.0.3 Apperance Expansion • Added header as a component • Updated Changelog page • Replaced default font with custom font 2024-12-07 v 1.0.2 Features Expansion • Enhanced performance & accessibility • Implemented chatbot system (WIP) • Updated About page • Static content for Changelog, Projects 2024-12-01 v 1.0.1 Apperance Expansion • Updated Home page • Adjusted color theme • Improved navigation structure 2024-11-24 v 1.0.0 Initial Release • Basic portfolio structure • Implemented header components • Added About, Projects, Changelog sections"
  }
]
